ednieuw/ESP32-2432S028R-display/ESP322432S028_WordClockV005/ESP322432S028_WordClockV005.ino
//--------------------------------------------
//  SCREEN ILI9341 Init screen ILI9341
//--------------------------------------------
void InitScreenILI9341(void)
{
// tft.begin();
 
   tft.init();
 SetBackLight(0XA0);   // Turn on the backlight 0 - 0xFF (0-255)
 tft.setRotation(1);   // upside down
// tft.fillScreen(ConvertRGB32toRGB16(C_ORANGE));                                             // Convert colors to RGB16, except C_BLACK (=0x000000)
 tft.setTextColor(C_BLACK, ConvertRGB32toRGB16(C_ORANGE));                                    // Convert colors to RGB16, except C_BLACK (=0x000000)
 tft.setCursor(0, tft.height()/3);
 tft.setTextSize(2);
 tft.println("Starting");
}
//--------------------------------------------                                                //
//  SCREEN ILI9341 Convert 32 bit RGBW to 16 bit RGB
//--------------------------------------------
uint16_t ConvertRGB32toRGB16(uint32_t sourceColor)
{
  uint32_t red   = (sourceColor & 0x00FF0000) >> 16;
  uint32_t green = (sourceColor & 0x0000FF00) >> 8;
  uint32_t blue  =  sourceColor & 0x000000FF;
  return (red >> 3 << 11) + (green >> 2 << 5) + (blue >> 3);
}

//--------------------------------------------
//  SCREEN ILI9341 Make the the screen black
//--------------------------------------------
void ClearScreenILI9341(void) 
{ 
  tft.fillScreen(ConvertRGB32toRGB16(Mem.BackGround));
}

//--------------------------------------------                                                //
//  SCREEN ILI9341
//  Print characters on the display with black background
//--------------------------------------------
void ShowCharsILI9341(void)
{
 int LEDnr = 0;
 for(int y = 0; y < MATRIX_HEIGHT; y++)
    for(int x = 0; x < MATRIX_WIDTH; x++, LEDnr++)
       {
        tft.drawChar(20 * x, 20 + 27 * y, Strippos[LEDnr].Character, 
                      ConvertRGB32toRGB16(Strippos[LEDnr].RGBColor), 
                      ConvertRGB32toRGB16(Mem.BackGround), 2); 
       }     
}


//--------------------------------------------                                                //
//  SCREEN ILI9341 Print the digital time in screen
//--------------------------------------------
void PrintTimeInScreen(void) 
{
 tft.setTextColor(ConvertRGB32toRGB16(LetterColor), C_BLACK);                                 // Convert colors to RGB16, except C_BLACK (=0x000000)
 GetTijd(0); 
// if(Mem.WIFIOnOff && !IP_Printed)                                                             // If WIFI is on print the IP-address
 {
  tft.setTextSize(1);
  tft.setCursor(20, 20); 
  PrintIPaddressInScreen(); 
  IP_Printed = true; 
  }
 sprintf(sptext,"%02d:%02d:%02d",timeinfo.tm_hour,timeinfo.tm_min,timeinfo.tm_sec);
 tft.setTextSize(6); 
 tft.setCursor(20, 90);
 Displayprint(sptext); 
 if (Date_Printed)  return;
 sprintf(sptext,"%02d-%02d-%04d",timeinfo.tm_mday,timeinfo.tm_mon+1,timeinfo.tm_year+1900);
 tft.setCursor(20, 200);
 tft.setTextSize(2);
 Displayprint(sptext);
 Date_Printed = true;
}
//--------------------------------------------                                                //
//  SCREEN ILI9341
// Print Web server IP address in screen
//--------------------------------------------
void PrintIPaddressInScreen()
{
 sprintf(sptext, "%d.%d.%d.%d", WiFi.localIP()[0], WiFi.localIP()[1], WiFi.localIP()[2], WiFi.localIP()[3] );
 Displayprintln(sptext);
}

//--------------------------------------------
// ANALOG CLOCK setup
//--------------------------------------------

void  AnalogClockSetupILI9341(void) 
{
 float sx, sy; 
 uint8_t smx = ScreenMiddleX;
 uint8_t smy = ScreenMiddleY;
 uint16_t x00=0, x11=0, y00=0, y11=0;
// tft.fillScreen(ConvertRGB32toRGB16(C_GRAY)); 
 tft.setTextColor(ConvertRGB32toRGB16(C_WHITE), ConvertRGB32toRGB16(C_GRAY));                // Adding a background colour erases previous text automatically
 tft.fillCircle(smx, smy, 118, ConvertRGB32toRGB16(C_GREEN));                                // Draw clock face
 tft.fillCircle(smx, smy, 110, ConvertRGB32toRGB16(C_BLACK));
 for(int i = 0; i<360; i+= 30)   // Draw 12 lines
   {
    sx = cos((i-90)*0.0174532925);                                                           // 0.0174532925 rad/s in 1 deg/s
    sy = sin((i-90)*0.0174532925);                                                           // 1 rad = 57.29577951 degrees
    x00 = sx*114+smx;
    y00 = sy*114+smy;
    x11 = sx*100+smx;
    y11 = sy*100+smy;
    tft.drawLine(x00, y00, x11, y11, ConvertRGB32toRGB16(C_GREEN));
   }
 for(int i = 0; i<360; i+= 6)                                                                // Draw 60 dots
   {
    sx = cos((i-90)*0.0174532925);
    sy = sin((i-90)*0.0174532925);
    x00 = sx*102+smx;
    y00 = sy*102+smy;
    tft.drawPixel(x00, y00, ConvertRGB32toRGB16(C_WHITE));                                   // Draw minute markers
    if(i==0  || i==180) tft.fillCircle(x00, y00, 2, ConvertRGB32toRGB16(C_WHITE));           // Draw main quadrant dots
    if(i==90 || i==270) tft.fillCircle(x00, y00, 2, ConvertRGB32toRGB16(C_WHITE));
   }
//  tft.fillCircle(160, 121, 3, ConvertRGB32toRGB16(C_WHITE));

}
//                                                                                            //
//--------------------------------------------
// ANALOG CLOCK Draw hands
//--------------------------------------------
void DrawAnalogeClockHands(void)
{
 uint8_t smx = ScreenMiddleX;
 uint8_t smy = ScreenMiddleY;
 static int ss=0,mm=0,hh=0;                                                                   // Pre-compute hand degrees, x & y coords for a fast screen update
 if (mm !=timeinfo.tm_min || ss==59) 
   {
    DrawMinuteHand(mm, 0, smx, smy, C_BLACK);                                                 // Erase old minute and hour hand
    DrawHourHand  (hh, mm, smx, smy, C_BLACK); 
    }
 DrawSecondHand(ss,   smx, smy, C_BLACK);                                                     // Redraw new hand positions, hour and minute hands not erased here to avoid flicker
 ss = (int) timeinfo.tm_sec;                                                                  // Retrieve the actual time
 mm = (int) timeinfo.tm_min;
 hh = (int) timeinfo.tm_hour;

 sprintf(sptext,"%02d:%02d:%02d",timeinfo.tm_hour,timeinfo.tm_min,timeinfo.tm_sec);           // Print the digital time in the analog clock
 tft.setTextSize(2); 
 tft.setTextColor(ConvertRGB32toRGB16(C_DARK_GOLDEN_ROD) , C_BLACK);                      // Backgound is transparany
 DrawMinuteHand(mm, 0,  smx, smy, ConvertRGB32toRGB16(C_WHITE));
 DrawHourHand(  hh, mm, smx, smy, ConvertRGB32toRGB16(C_WHITE)); 
 DrawSecondHand(ss,     smx, smy, ConvertRGB32toRGB16(C_RED));                                                        // Erase previous text                                       
 tft.setCursor(0,0); // smx-50, smy/2);
 Displayprint(sptext);                                                                        // Print the time digital
}
//--------------------------------------------
// ANALOG CLOCK Draw second hands
//--------------------------------------------
void DrawSecondHand(int ss , uint8_t smx, uint8_t smy, uint32_t Kleur)
{  
 if(ss <0 ) ss = 59;                                    
 uint16_t osx = cos((ss * 6 - 90) * 0.0174532925) * 90 + smx;                                 // 0-59 ss -> 0-354 degrees
 uint16_t osy = sin((ss * 6 - 90) * 0.0174532925) * 90 + smy; 
 tft.drawLine(osx,   osy,   smx, smy, Kleur);    
 tft.fillCircle(smx, smy, 3, 0xF800);
}
//--------------------------------------------
// ANALOG CLOCK Draw minute hands
//--------------------------------------------
void DrawMinuteHand(int mm, int ss, uint8_t smx, uint8_t smy, uint32_t Kleur)
{
 if(mm < 0) mm = 59;
 if(ss <0 ) ss = 59;  
 uint8_t ycorr = 0, xcorr = 0;
 float mdeg = mm * 6; //+ ss * 6 * 0.01666667;                                                // 0-59 -> 0-360 - includes not seconds
 uint16_t omx = cos((mdeg-90)*0.0174532925) * 84 + smx;    
 uint16_t omy = sin((mdeg-90)*0.0174532925) * 84 + smy;
// sprintf(sptext,"MINUUT: mm:%d ss:%d ohx:%d ohy:%d ",mm,ss,omx,omy ); Tekstprintln(sptext);

 if(mm>7  && mm <22) {xcorr = 0; ycorr = 1;} 
 if(mm>21 && mm <38) {xcorr = 1; ycorr = 0;}    
 if(mm>37 && mm <52) {xcorr = 0; ycorr = 1;} 
 if(mm>51 || mm <8)  {xcorr = 1; ycorr = 0;}  
 for (int n=-4; n<5; n++)
   tft.drawLine(omx + 0 * xcorr, omy + 0 * ycorr, smx + n * xcorr, smy + n * ycorr, Kleur); 
  
